import { AsciiCharsetPreset } from './type';

export const ANCIENT_LANGUAGES: AsciiCharsetPreset[] = [
  {
    name: 'Ogham',
    charset: 'ᚁᚂᚃᚄᚅᚆᚇᚈᚉᚊᚋᚌᚍᚎᚏᚐᚑᚒᚓᚔᚕᚖᚗᚘᚙᚚ ',
    font: 'NotoSansOgham',
  },
  {
    name: 'Runic',
    charset: 'ᚠᚢᚦᚨᚱᚲᚷᚹᚺᚻᚾᛁᛃᛇᛈᛉᛊᛋᛏᛒᛖᛗᛚᛜᛝᛟᛞᛟᛠᛡᛢᛣᛤᛥᛦᛧᛨᛩᛪ ',
    font: 'NotoSansRunic',
  },
  {
    name: 'Glagolitic',
    charset: 'ⰀⰁⰂⰃⰄⰅⰆⰇⰈⰉⰊⰋⰌⰍⰎⰏⰐⰑⰒⰓⰔⰕⰖⰗⰘⰙⰚⰛⰜⰝⰞⰟⰠⰡⰢⰣⰤⰥⰦⰧⰨⰩⰪⰫ ',
    font: 'NotoSansGlagolitic',
  },
  {
    name: 'Coptic',
    charset: 'ⲀⲂⲄⲆⲈⲊⲌⲎⲐⲒⲔⲖⲘⲚⲜⲞⲠⲢⲤⲦⲨⲪⲬⲮⲰⲲⲴⲶⲸⲺⲼⲾⳀⳂⳄⳆⳈⳊⳌⳎⳐⳒⳔⳖⳘⳚⳜⳞⳠⳢ ',
    font: 'NotoSansCoptic',
  },
  {
    name: 'Old Persian',
    charset: '𐎠𐎡𐎢𐎣𐎤𐎥𐎦𐎧𐎨𐎩𐎪𐎫𐎬𐎭𐎮𐎯𐎰𐎱𐎲𐎳𐎴𐎵𐎶𐎷𐎸𐎹𐎺𐎻𐎼𐎽𐎾𐎿𐏀𐏁𐏂𐏃 ',
    font: 'NotoSansOldPersian',
  },
  {
    name: 'Avestan',
    charset: '𐬀𐬁𐬂𐬃𐬄𐬅𐬆𐬇𐬈𐬉𐬊𐬋𐬌𐬍𐬎𐬏𐬐𐬑𐬒𐬓𐬔𐬕𐬖𐬗𐬘𐬙𐬚𐬛𐬜𐬝𐬞𐬟𐬠𐬡𐬢𐬣𐬤𐬥𐬦𐬧𐬨𐬩𐬪𐬫𐬬𐬭𐬮𐬯𐬰𐬱𐬲𐬳𐬴𐬵 ',
    font: 'NotoSansAvestan',
  },
  {
    name: 'Pahlavi',
    charset: '𐭠𐭡𐭢𐭣𐭤𐭥𐭦𐭧𐭨𐭩𐭪𐭫𐭬𐭭𐭮𐭯𐭰𐭱𐭲𐭳𐭴𐭵𐭶𐭷𐭸𐭹𐭺𐭻𐭼𐭽𐭾𐭿 ',
    font: 'NotoSansInscriptionalPahlavi',
  },
  {
    name: 'Phoenician',
    charset: '𐤀𐤁𐤂𐤃𐤄𐤅𐤆𐤇𐤈𐤉𐤊𐤋𐤌𐤍𐤎𐤏𐤐𐤑𐤒𐤓𐤔𐤕 ',
    font: 'NotoSansPhoenician',
  },
  {
    name: 'Lydian',
    charset: '𐤠𐤡𐤢𐤣𐤤𐤥𐤦𐤧𐤨𐤩𐤪𐤫𐤬𐤭𐤮𐤯𐤱𐤲𐤳𐤴𐤵𐤶𐤷𐤸 ',
    font: 'NotoSansLydian',
  },
  {
    name: 'Kharoshthi',
    charset: '𐨀𐨁𐨂𐨃𐨅𐨆𐨌𐨍𐨎𐨏𐨐𐨑𐨒𐨓𐨕𐨖𐨗𐨙𐨚𐨛𐨜𐨝𐨞𐨟𐨠𐨡𐨢𐨣𐨤𐨥𐨦𐨧𐨨𐨩𐨪𐨫𐨬𐨭𐨮𐨯𐨰𐨱𐨲𐨳𐨴𐨵 ',
    font: 'NotoSansKharoshthi',
  },
  {
    name: 'Old South Arabian',
    charset: '𐩠𐩡𐩢𐩣𐩤𐩥𐩦𐩧𐩨𐩩𐩪𐩫𐩬𐩭𐩮𐩯𐩰𐩱𐩲𐩳𐩴𐩵𐩶𐩷𐩸𐩹𐩺𐩻𐩼𐩽𐩾 ',
    font: 'NotoSansOldSouthArabian',
  },
  {
    name: 'Manichaean',
    charset: '𐫀𐫁𐫂𐫃𐫄𐫅𐫆𐫇𐫈𐫉𐫊𐫋𐫌𐫍𐫎𐫏𐫐𐫑𐫒𐫓𐫔𐫕𐫖𐫗𐫘𐫙𐫚𐫛𐫜𐫝𐫞𐫟𐫠𐫡𐫢𐫣𐫤𐫦𐫥𐫧𐫨𐫩𐫪𐫫𐫬𐫭𐫮𐫯𐫰𐫱𐫲 ',
    font: 'NotoSansManichaean',
  },
  {
    name: 'Aramaic',
    charset: '𐡀𐡁𐡂𐡃𐡄𐡅𐡆𐡇𐡈𐡉𐡊𐡋𐡌𐡎𐡏𐡐𐡑𐡒𐡓𐡔𐡕 ',
    font: 'NotoSansImperialAramaic',
  },
  {
    name: 'Nabataean',
    charset: '𐢀𐢁𐢂𐢃𐢄𐢅𐢆𐢇𐢈𐢉𐢊𐢋𐢌𐢍𐢎𐢏𐢐𐢑𐢒𐢓𐢔𐢕 ',
    font: 'NotoSansNabataean',
  },
  {
    name: 'Palmyrene',
    charset: '𐡠𐡡𐡢𐡣𐡤𐡥𐡦𐡧𐡨𐡩𐡪𐡫𐡬𐡭𐡮𐡯𐡰𐡱𐡲𐡳𐡴𐡵 ',
    font: 'NotoSansPalmyrene',
  },
  {
    name: 'Hatran',
    charset: '𐣠𐣡𐣢𐣣𐣤𐣥𐣦𐣧𐣨𐣩𐣪𐣫𐣬𐣭𐣮𐣯𐣰𐣱𐣲𐣳𐣴𐣵𐣶𐣷𐣸𐣹𐣺𐣻𐣼𐣽𐣾𐣿 ',
    font: 'NotoSansHatran',
  },
  {
    name: 'Psalter Pahlavi',
    charset: '𐮀𐮁𐮂𐮃𐮄𐮅𐮆𐮇𐮈𐮉𐮊𐮋𐮌𐮍𐮎𐮏𐮐𐮑𐮒𐮓𐮔𐮕𐮖𐮗𐮘𐮙𐮚𐮛𐮜𐮝𐮞𐮟𐮠𐮡𐮢𐮣𐮤𐮥𐮦𐮧𐮨𐮩𐮪𐮫𐮬𐮭𐮮𐮯𐮰𐮱𐮲 ',
    font: 'NotoSansPsalterPahlavi',
  },
  {
    name: 'Old Turkic',
    charset: '𐰀𐰁𐰂𐰃𐰄𐰅𐰆𐰇𐰈𐰉𐰊𐰋𐰌𐰍𐰎𐰏𐰐𐰑𐰒𐰓𐰔𐰕𐰖𐰗𐰘𐰙𐰚𐰛𐰜𐰝𐰞𐰟𐰠𐰡𐰢𐰣𐰤𐰥𐰦𐰧𐰨𐰩𐰪𐰫𐰬𐰭𐰮𐰯𐰰𐰱𐰲 ',
    font: 'NotoSansOldTurkic',
  },
  {
    name: 'Old Hungarian',
    charset: '𐲀𐲁𐲂𐲃𐲄𐲅𐲆𐲇𐲈𐲉𐲊𐲋𐲌𐲍𐲎𐲏𐲐𐲑𐲒𐲓𐲔𐲕𐲖𐲗𐲘𐲙𐲚𐲛𐲜𐲝𐲞𐲟𐲠𐲡𐲢𐲣𐲤𐲥𐲦𐲧𐲨𐲩𐲪𐲫𐲬𐲭𐲮𐲯𐲰𐲱𐲲 ',
    font: 'NotoSansOldHungarian',
  },
  {
    name: 'Hanifi Rohingya',
    charset: '𐴰𐴱𐴲𐴳𐴴𐴵𐴶𐴷𐴸𐴹𐴺𐴻𐴼𐴽𐴾𐴿𐵀𐵁𐵂𐵃𐵄𐵅𐵆𐵇𐵈𐵉𐵊𐵋𐵌𐵍𐵎𐵏 ',
    font: 'NotoSansHanifiRohingya',
  },
  {
    name: 'Yezidi',
    charset: '𐺀𐺁𐺂𐺃𐺄𐺅𐺆𐺇𐺈𐺉𐺊𐺋𐺌𐺍𐺎𐺏𐺐𐺑𐺒𐺓𐺔𐺕𐺖𐺗𐺘𐺙𐺚𐺛𐺜𐺝𐺞𐺟𐺠𐺡𐺢𐺣𐺤𐺥𐺦𐺧𐺨𐺩𐺪𐺫𐺬𐺭𐺮𐺯𐺰𐺱𐺲𐺳𐺴𐺵𐺶𐺷𐺸𐺹𐺺𐺻𐺼𐺽𐺾𐺿 ',
    font: 'NotoSerifYezidi',
  },
  {
    name: 'Old Sogdian',
    charset: '𐼀𐼁𐼂𐼃𐼄𐼅𐼆𐼇𐼈𐼉𐼊𐼋𐼌𐼍𐼎𐼏𐼐𐼑𐼒𐼓𐼔𐼕𐼖𐼗𐼘𐼙𐼚𐼛𐼜𐼝𐼞𐼟𐼠𐼡𐼢𐼣𐼤𐼥𐼦𐼧𐼨𐼩𐼪𐼫𐼬𐼭𐼮𐼯𐼰𐼱𐼲𐼳𐼴𐼵𐼶𐼷𐼸𐼹𐼺𐼻𐼼𐼽𐼾𐼿 ',
    font: 'NotoSansSogdian',
  },
  {
    name: 'Sogdian',
    charset: '𐼰𐼱𐼲𐼳𐼴𐼵𐼶𐼷𐼸𐼹𐼺𐼻𐼼𐼽𐼾𐼿𐽀𐽁𐽂𐽃𐽄𐽅𐽆𐽇𐽋𐽍𐽎𐽏𐽐𐽈𐽉𐽊𐽌𐽑𐽒𐽓𐽔𐽕𐽖𐽗𐽘𐽙𐽚𐽛𐽜𐽝𐽞𐽟𐽠𐽡𐽢𐽣𐽤𐽥𐽦𐽧𐽨𐽩𐽪𐽫𐽬𐽭𐽮𐽯 ',
    font: 'NotoSansSogdian',
  },
];
